namespace ErrorRelics.ErrorRelicsCode.Fragments;

public enum ErrorEffectId
{
    // =========================================================
    // E001
    // 来源遗物：Vajra
    //
    // Effect：
    // 获得 1 点 Strength
    // =========================================================
    E001_GainStrength1,


    // =========================================================
    // E002
    // 来源遗物：Razor Tooth
    //
    // Effect：
    // 升级当前打出的牌
    // =========================================================
    E002_UpgradePlayedCard,


    // =========================================================
    // E003
    // 来源遗物：Mercury Hourglass
    //
    // Effect：
    // 对所有敌人造成 3 点伤害
    // =========================================================
    E003_DamageAllEnemies3,


    // =========================================================
    // E004
    // 来源遗物：Old Coin
    //
    // Effect：
    // 获得 300 Gold
    // =========================================================
    E004_GainGold300,


    // =========================================================
    // E005
    // 来源遗物：Mummified Hand
    //
    // Effect：
    // 随机选择当前手牌中的一张牌
    // 使其本回合免费
    // =========================================================
    E005_RandomHandCardFreeThisTurn,


    // =========================================================
    // E006
    // 来源遗物：Distinguished Cape
    //
    // Effect A：
    // 向牌组加入 3 张 Apparition
    // =========================================================
    E006_Add3Apparitions,


    // =========================================================
    // E010
    // 来源遗物：Distinguished Cape
    //
    // Effect B：
    // 从当前可生成的 Curse 中
    // 随机选择 2 张不同的 Curse
    // 加入牌组
    // =========================================================
    E010_Add2RandomCurses
}